In [1]:
import pandas as pd

In [2]:
df_ref = pd.read_csv("data/bengaluru_house_data.csv")
df_ref.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [3]:
df_ref.columns

Index(['area_type', 'availability', 'location', 'size', 'society',
       'total_sqft', 'bath', 'balcony', 'price'],
      dtype='object')

In [49]:
df_ref.describe()

               bath       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [4]:
# Checking for df_ref shape (Row, Columns) in reference DataFrame
df_ref.shape

(13320, 9)

In [5]:
df_a = df_ref.drop(labels = ['area_type', 'availability', 'society', 'balcony'], axis = 'columns')
df_a.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [6]:
# Checking for featurwise null values 
df_a.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [7]:
# Drop rows contain NA value
df_b = df_a.dropna(axis = 'index')
df_b.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [8]:
df_b.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [9]:
# Checking for df_ref shape (Row, Columns) in df_b DataFrame
df_b.shape

(13246, 5)

In [10]:
# Observing unique values in <size> feature of DataFrame <df_b>
df_b['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [11]:
df_b['bhk'] = df_b['size'].apply(lambda val: val.split(' ')[0])
df_b.drop(labels = ['size'], axis = 1)
df_b.head()

C:\Users\mistertandon\Anaconda3\envs\applied-ai\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

                   location       size total_sqft  bath   price bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07   2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00   4
2               Uttarahalli      3 BHK       1440   2.0   62.00   3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00   3
4                  Kothanur      2 BHK       1200   2.0   51.00   2

In [12]:
df_b['bhk'].unique()

array(['2', '4', '3', '6', '1', '8', '7', '5', '11', '9', '27', '10',
       '19', '16', '43', '14', '12', '13', '18'], dtype=object)

In [13]:
# We may observe Scalar values as well as Range Values in <total_sqft> feature
df_b['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [14]:
# Let's build a function to search for Range Values
def serch_range_values(x):
    try:
        float(x)
    except:
        return False
    
    return True

In [15]:
df_c = df_b[~df_b['total_sqft'].apply(serch_range_values)]
df_c.head()

               location   size   total_sqft  bath    price bhk
30            Yelahanka  4 BHK  2100 - 2850   4.0  186.000   4
122              Hebbal  4 BHK  3067 - 8156   4.0  477.000   4
137  8th Phase JP Nagar  2 BHK  1042 - 1105   2.0   54.005   2
165            Sarjapur  2 BHK  1145 - 1340   2.0   43.490   2
188            KR Puram  2 BHK  1015 - 1540   2.0   56.800   2

In [16]:
df_c.shape

(190, 6)

In [17]:
import numpy as np

In [18]:
def range_values_to_scalar(x):
    
    tokens = x.split('-')

    if len(tokens) == 2:
        
        tokens_float = [float(token) for token in tokens]
        tokens_mean = np.mean(tokens_float)
        
        return tokens_mean
    else:
        try:
            return float(x)
        except:
            return False

In [19]:
df_b['total_sqft_float'] = df_b['total_sqft'].apply(range_values_to_scalar)
df_b.head(n = 3)

C:\Users\mistertandon\Anaconda3\envs\applied-ai\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

,location,size,total_sqft,bath,price,bhk,total_sqft_float
0,Electronic City Phase II,2 BHK,1056,2.0,39.07,2,1056
1,Chikka Tirupathi,4 Bedroom,2600,5.0,120.00,4,2600
2,Uttarahalli,3 BHK,1440,2.0,62.00,3,1440

In [20]:
dumy_df_a = df_b[df_b['total_sqft_float'] == False]
dumy_df_a.head(n = 3)

         location       size      total_sqft  bath  price bhk total_sqft_float
410       Kengeri      1 BHK  34.46Sq. Meter   1.0   18.5   1            False
648       Arekere  9 Bedroom       4125Perch   9.0  265.0   9            False
775  Basavanagara      1 BHK   1000Sq. Meter   2.0   93.0   1            False

In [21]:
dumy_df_a.shape

(46, 7)

In [22]:
# Examine feature <total_sqft_float> for <False> value
df_c = df_b[df_b['total_sqft_float'] != False]
df_c.head(n = 3)

,location,size,total_sqft,bath,price,bhk,total_sqft_float
0,Electronic City Phase II,2 BHK,1056,2.0,39.07,2,1056
1,Chikka Tirupathi,4 Bedroom,2600,5.0,120.00,4,2600
2,Uttarahalli,3 BHK,1440,2.0,62.00,3,1440

In [23]:
# Examine feature <total_sqft_float> for <False> value, and verify no <False> value exist in <df_d>
df_c[df_c['total_sqft_float'] == False]

Empty DataFrame
Columns: [location, size, total_sqft, bath, price, bhk, total_sqft_float]
Index: []

In [24]:
# Feature Engineering

In [25]:
df_c.shape

(13200, 7)

In [26]:
df_c.head(n = 3)

,location,size,total_sqft,bath,price,bhk,total_sqft_float
0,Electronic City Phase II,2 BHK,1056,2.0,39.07,2,1056
1,Chikka Tirupathi,4 Bedroom,2600,5.0,120.00,4,2600
2,Uttarahalli,3 BHK,1440,2.0,62.00,3,1440

In [27]:
df_c.head(n = 3)

,location,size,total_sqft,bath,price,bhk,total_sqft_float
0,Electronic City Phase II,2 BHK,1056,2.0,39.07,2,1056
1,Chikka Tirupathi,4 Bedroom,2600,5.0,120.00,4,2600
2,Uttarahalli,3 BHK,1440,2.0,62.00,3,1440

In [28]:
df_c['price_per_sqft'] = (df_c['price'] * 100000) / df_c['total_sqft_float']
df_c.head(n = 3)

C:\Users\mistertandon\Anaconda3\envs\applied-ai\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

,location,size,total_sqft,bath,price,bhk,total_sqft_float,price_per_sqft
0,Electronic City Phase II,2 BHK,1056,2.0,39.07,2,1056,3699.81
1,Chikka Tirupathi,4 Bedroom,2600,5.0,120.00,4,2600,4615.38
2,Uttarahalli,3 BHK,1440,2.0,62.00,3,1440,4305.56

In [29]:
# Unique locations name
len(df_c['location'].unique())

1298

In [30]:
location_agg_count = df_c.groupby('location')['location'].agg('count').sort_values(ascending = False)
location_agg_count[:10]

location
Whitefield               532
Sarjapur  Road           392
Electronic City          302
Kanakpura Road           264
Thanisandra              232
Yelahanka                210
Uttarahalli              186
Hebbal                   176
Marathahalli             175
Raja Rajeshwari Nagar    171
Name: location, dtype: int64

In [31]:
type(location_agg_count)

pandas.core.series.Series

In [32]:
location_stats_less_than_10 = location_agg_count[location_agg_count < 10]
len(location_stats_less_than_10)

1045

In [33]:
df_c['location_fe'] = df_c['location'].apply(lambda location: 'other' if location in location_stats_less_than_10 else location)
df_c.head(n = 3)

C:\Users\mistertandon\Anaconda3\envs\applied-ai\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

,location,size,total_sqft,bath,price,bhk,total_sqft_float,price_per_sqft,location_fe
0,Electronic City Phase II,2 BHK,1056,2.0,39.07,2,1056,3699.81,Electronic City Phase II
1,Chikka Tirupathi,4 Bedroom,2600,5.0,120.00,4,2600,4615.38,Chikka Tirupathi
2,Uttarahalli,3 BHK,1440,2.0,62.00,3,1440,4305.56,Uttarahalli

In [34]:
df_c.shape

(13200, 9)

In [35]:
dumy_df_b = df_c[df_c['location_fe'] == 'other']
dumy_df_b.head(n = 3)

,location,size,total_sqft,bath,price,bhk,total_sqft_float,price_per_sqft,location_fe
9,Gandhi Bazar,6 Bedroom,1020,6.0,370.0,6,1020,36274.5,other
18,Ramakrishnappa Layout,3 BHK,2770,4.0,290.0,3,2770,10469.3,other
19,Manayata Tech Park,2 BHK,1100,2.0,48.0,2,1100,4363.64,other

In [36]:
dumy_df_b.shape

(2757, 9)

In [37]:
df_c.columns

Index(['location', 'size', 'total_sqft', 'bath', 'price', 'bhk',
       'total_sqft_float', 'price_per_sqft', 'location_fe'],
      dtype='object')

In [38]:
# Outlier Removal
df_d = df_c.copy()
df_d.drop(labels = ['location', 'total_sqft'], axis = 'columns', inplace = True)
df_d.head(n = 3)

,size,bath,price,bhk,total_sqft_float,price_per_sqft,location_fe
0,2 BHK,2.0,39.07,2,1056,3699.81,Electronic City Phase II
1,4 Bedroom,5.0,120.00,4,2600,4615.38,Chikka Tirupathi
2,3 BHK,2.0,62.00,3,1440,4305.56,Uttarahalli

In [61]:
df_d.price_per_sqft.astype(float).describe()

count    1.320000e+04
mean     7.920759e+03
std      1.067272e+05
min      2.678298e+02
25%      4.267701e+03
50%      5.438331e+03
75%      7.317073e+03
max      1.200000e+07
Name: price_per_sqft, dtype: float64

In [64]:
df_out = pd.DataFrame()
for location_name, subdf in df_d.groupby('location_fe'):
    
    std_1 = subdf['price_per_sqft'].std()
    mean_price = subdf['price_per_sqft'].mean()
    
    reduced_df = subdf[(subdf.price_per_sqft > (mean_price - std_1)) & (subdf.price_per_sqft < (mean_price + std_1))]
    
    df_out = pd.concat([df_out, reduced_df], axis = 0, ignore_index = True)
df_out.shape

(11448, 7)